// let knb = Math.floor(Math.random() * 3);
// if (knb == 1) {
//     knb = 'камень'
// }
// else if (knb == 2) {
//     knb = 'ножницы'
// }

// else {
//     knb = 'бумага'
// }

// let user = prompt('выберите выигрышное слово: камень/ножницы/бумага/');
// if (user == knb) {
//     alert('Ничья');
// }

// else if ((user == 'камень' && knb == 'ножницы') || (user == 'ножницы' && knb == 'бумага') || (user == 'бумага' && knb == 'камень')) {
//     alert('Вы выйграли')
// }

// else if ((user == 'камень' && knb == 'бумага') || (user == 'ножницы' && knb == 'камень') || (user == 'бумага' && knb == 'ножницы')) {
//     alert('Вы проиграли')
// }

// else {
//     alert('ошибка')
// }






let knb = Math.floor(Math.random() * 3);
if (knb == 1) {
    knb = 'камень'
}
else if (knb == 2) {
    knb = 'ножницы'
}

else if (knb == 3) {
    knb = 'бумага'
}

let user = prompt('выберите выигрышное слово: камень/ножницы/бумага/огонь/губка/вода/воздух');
if (user == knb) {
    alert('Ничья');
}

else if ((user == 'камень' && knb == 'ножницы') || (user == 'камень' && knb == 'огонь') || (user == 'камень' && knb == 'губка') || (user == 'ножницы' && knb == 'бумага') || (user == 'ножницы' && knb == 'губка') || (user == 'ножницы' && knb == 'воздух') || (user == 'бумага' && knb == 'камень') || (user == 'бумага' || knb == 'воздух') || (user == 'бумага' && knb == 'вода') || (user == 'огонь' && knb == 'ножницы') || (user == 'огонь' && knb == 'губка') || (user == 'огонь' && knb == 'бумага') || (user == 'вода' && knb == 'камень') || (user == 'вода' && knb == 'огонь') || (user == 'вода' && knb == 'ножницы') || (user = 'вода' && knb == 'вода') || (user == 'губка' && knb == 'бумага') || (user == 'губка' && kbn == 'воздух') || (user == 'губка' && knb == 'вода') || (user == 'воздух' || knb == 'огонь') || (user == 'воздух' && knb == 'вода') || (user == 'воздух' && knb == 'камень')) {
    alert('Вы выйграли')
}

else if ((user == 'камень' && knb == 'бумага') || (user == 'камень' && knb == 'воздух') || (user == 'камень' && knb == 'вода') || (user == 'ножницы' && knb == 'огонь') || (user == 'ножницы' && knb == 'камень') || (user == 'ножницы' && knb == 'вода') || (user == 'бумага' && knb == 'ножницы') || (user == 'бумага' || knb == 'огонь') || (user == 'бумага' && knb == 'губка') || (user == 'огонь' && knb == 'камень') || (user == 'огонь' && knb == 'вода') || (user == 'огонь' && knb == 'воздух') || (user == 'вода' && knb == 'губка') || (user == 'вода' && knb == 'бумага') || (user == 'вода' && knb == 'воздух') || (user == 'губка' && knb == 'камень') || (user == 'губка' && kbn == 'огонь') || (user == 'губка' && knb == 'ножницы') || (user == 'воздух' || knb == 'ножницы') || (user == 'воздух' && knb == 'губка') || (user == 'воздух' && knb == 'бумага')) {
    alert('Вы проиграли')
}

else {
    alert('ошибка')
}