// let day = prompt('Введите день недели')
// if (day == 'суббота') {
//     alert('Хороших выходных!')
// }
// else if (day == 'воскресенье') {
//     alert('Хорошего выходного!')
// }
// else {
//     alert('Ещё чуть-чуть и можно отдохнуть')
// }





// let name = prompt('Как зовут главного робота?');
// (name == 'Айтигенио') ? alert('Угадал') : alert('Не угадал');



// let a = prompt('Введите число а');
// let b = prompt('Введите число b');
// let maximum = `${a}` > `${b}`;
// (maximum) ? alert(a) : alert(b);



// let time = prompt('Введите время');
// (time < 8) ? alert('Доброе утро') || alert('Солнце уже взошло') || alert('Тебе еще можно повалятся в постеле :)') : alert('Ты проспал!') || alert('Трррревога!');


let x = prompt('Введите число');
(x == -1) ? alert('blue') : alert('red');